### 1) Add the Pandas dependency.

In [1]:
import pandas as pd

### 2)  Files to Load

In [2]:
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

### 3) Read the school data file and store it in a Pandas DataFrame

In [3]:
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

### 4) Read the student data file and store it in a Pandas DataFrame.

In [4]:
student_data_df = pd.read_csv(student_data_to_load,  index_col=[0])
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

### 5) Determine if there are any missing values in the school data - using count() method
We can see there are no missing values because there are 15 rows that contain data in schools_complete.csv.

In [5]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

### 6) Determine if there are any missing values in the student data -  using count() method
Again, no missing values b/c output shows 39170 rows for the csv file

In [6]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

### 7) Determine if there are any missing values in the school data - using isnull() method
When we execute this code, we see that every row that is not empty is given the Boolean value "False," which tells us that there are no missing values.

In [7]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

### 8) Determine if there are any missing values in the student data - using isnull() method
A) Output shows that there are no rows that contain missing values; they are all "False."

In [8]:
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

B) Determine if there are any missing values in the student data using -isnull() more efficiently 

 - Chaining two (+) methods or functions together separated by period

 - Get the total number of empty rows, or rows that are "True"

In [9]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

### 9) Determine if there are not any missing values in the school data - using notnull() method
Output returns a copy of our school_data_df DataFrame, where all the rows that do not have any missing values are labeled "True." 
 - Returns the opposite output of the isnull() method

In [10]:
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

### 10) Determine if there are not any missing values in the student data - using notnull() method
Chaining two (+) methods or functions together separated by period
 - Get sum of all columns that are "True" (not null)

In [11]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

### 11) Determine the data types for the school DataFrame -- Using dtypes
"School ID," "size," and "budget" are integers, which is the correct data type for performing arithmetic calculations.

In [12]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

### 12) Determine the data types for the budget column -- using dtype
Use df.column.dtype if the column name doesn't have spaces in the name, like school_name. 
* If there are spaces, we must use df["column"].dtype like this: school_data_df["budget"].dtype

In [13]:
school_data_df.budget.dtype

dtype('int64')

### 13) Determine data types for the student_data DataFrame -- Using dtypes
Returns each column name and the data type of each column. 
* "Student ID," "reading_score," and "math_score" are integers, which is the correct data type for performing arithmetic calculations

In [14]:
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

### 14) Fix Students2019 Names
Using the same code that we tested for cleaning the students' names, we will fix the students' names so they match their school records

In [15]:
# a) Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", 
                     " MD", " DDS", " DVM", " PhD"]

# b) Iterate through words (pre/suffxs) in the "prefixes_suffixes" list 
for word in prefixes_suffixes:
    
    # c) Replace words in the list (pre/suffxs) with an empty space, "".
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

# d) Print student DataFrame
student_data_df.head(10)

C:\Users\ewaas\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:9: FutureWarning: The default value of regex will change from True to False in a future version.
  if __name__ == '__main__':

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

# Save data back to CSV File 
(apparently it did that when I saved the cleaning_student_names file)

### 15) Merge dataFrames on shared columns using merge()
Combine the two dataFrames into a single dataset.
* School ID, type, size, and budget should be the last columns now

New DF is results of merging DF#2 ("right" DF = school_data_df) with DF#1 ("Left" DF = student_data_df) 
* L and R DFs reflect the order in which they appear inside parentheses.

* Can also write the column name "on="school_name" just once

In [16]:
# a) Create new dataFrame for the merged df's (school_data_complete_df)  
# b)  Use parameter "on=[]" , which is equal to a list of columns that 
        # are identicalfrom each DF. (school_name in this case) 
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])

# c) Print out the merged DF
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

### 16) Get the total number of students in the school district
We are counting all the items in each row for each column that is not null  

Use this code to get the total number of rows (or values) for each column: 
student_count = school_data_complete_df.count()
* Output: list of each column name with 39170 rows (or values in each column)


Since they are all the same, we can use any column to get the student count. 

Use this modified format to find the student count for a particular column: 
school_data_complete_df[column].count()

We are going to assign the "student_count" variable to a column that identifies with students to get the student count. 
* We picked Student ID.

Output should change from list with each column displaying 39170 to just 39170
* We can't use this because it just gives us 39170

In [17]:
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

### 17) Calculate the total number of schools

#### A) Calculate the total number of schools using count()
Use school_data_df DataFrame and assign a variabel to one of the columns in the DF. 
* This gives a count of how many school names there are in the school data DF
* Refer to #3. There are 15 rows in that data frame, one for each school.

In [18]:
school_count = school_data_df["school_name"].count()
school_count

15

#### B) Calculate the total number of schools using .unique()
* Returns an ndarray = n-dimensional array of all the unique values of that column

In [19]:
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

### 18) Get the total budget

#### A) Refer to school_data_complete_df in step 15. 
##### (The dataFrame we created by erging student_data_df with school_data_df)
In this DF, each student is associated with a school, and all data related to that school
* If we use, sum() on the budget column on this DF, we get: (first row of code in cell below)

Output: 82932329558
* This summed all 39,170 rows in the budget column of the df. 
* This is incorrect.

In [20]:
total_budget_0 = school_data_complete_df["budget"].sum()
total_budget_0

82932329558

#### B) To calculate the total budget: 
Apply the .sum()method to budget column in school_data_df 
* Refer to #3
Output should be 24649428. 
* Verify by using sum(E3:E16) in csv file. Don't save. It matches.

In [21]:
total_budget = school_data_df["budget"].sum()
total_budget

24649428

### 19) Get the test score averages

#### A) Calculate the average reading score
* Create a variable (avg reading score)
* Find mean of all values in "reading score" column within school_data_complete_df
* Print the average reading score for all students.

In [22]:
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

#### B) Calculate the average math score

* Create a variable (avg math score)
* Find mean of all values in "math score" column within school_data_complete_df
* Print the average reading score for all students.

In [23]:
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

### 20) Get the Passing Percentages

#### A) Determine the passing grade
Create two new variable to store the passing grades for math and reading 
* (passing_math and passing_reading)

Within the math/reading_score column of school_data_complete_df, determine if value is greater than or equal to 70, the value we determine to be passing.

In [24]:
passing_math = school_data_complete_df["math_score"]>=70
passing_reading = school_data_complete_df["reading_score"]>=70

#### B) Print Math
Output: True >= 70 ; False < 70

In [25]:
passing_math.head()

0     True
1    False
2    False
3    False
4     True
Name: math_score, dtype: bool

#### C) Print Reading
Output: True >= 70 ; False < 70

In [26]:
passing_reading.head()

0    False
1     True
2     True
3    False
4     True
Name: reading_score, dtype: bool

### 21) Get the Number of Students Who Passed Math / Reading

#### A) Get Number of Students Who Passed Math into a new dataFrame
* Create new variable to store students who are passing math (passing_math)
* Filter school_data_complete_df for only "True" cases
* Add [school_data_complete_df["math_score"] >= 70] within [brackets] to filter through students in the school_data_complete_df who had a math score >=70
* Print list of students who passed math

In [27]:
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

#### B) Get Number of Students Who Passed Reading into a new dataFrame (Repurpose Code for Math)
* Create new variable to store students who are passing reading (passing_reading)
* Filter school_data_complete_df for only "True" cases
* Add [school_data_complete_df["reading_score"] >= 70] within [brackets] to filter through students in the school_data_complete_df who had a reading score >=70
* Print list of students who passed reading

In [28]:
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

#### C) Get the number of students who passed math / reading from the new dataFrames we just created in Step 21
* Calculate the number of students passing math.
* Calculate the number of students passing reading.

* Print the lists with the counts of students who passed for math/reading

In [29]:
passing_math_count = passing_math["student_name"].count()
passing_reading_count = passing_reading["student_name"].count()

In [30]:
print(passing_math_count)
print(passing_reading_count)

29370
33610

### 22) Get the Percentage of Students Who Passed Math/Reading
Calculate percentage that passed Math

Calculate the percent that passed Reading
* Recall that student count was calculated using: school_data_complete_df["Student ID"].count; 
* Gave us a total of 39170 students

Print the lists with the percentages of students who passed for math/reading

In [31]:
passing_math_percentage = passing_math_count / float(student_count) * 100
passing_reading_percentage = passing_reading_count / float(student_count) * 100

In [32]:
print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

### 23) Calculate Overall Passing Percentage (if student passed BOTH math and reading)
Calculate percentage of students who passed BOTH math AND reading
* Join by using "&"

Print list of students who passed BOTH math and reading

In [33]:
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & 
                                               (school_data_complete_df["reading_score"] >= 70)]
passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

### 24) Get Total Count and Percentage of students who passed BOTH math and reading
Calculate the number of students who passed both math and reading.

Calculate the overall passing percentage.

In [34]:
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [35]:
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

### 25) Create a New dataFrame with columns for all the metrics we calculated 
Adding a list of values with keys to create a new DataFrame.

Create a list of dictionaries, where keys = column names and values = calculated metrics

We did this bc DF has no indexing; lists have natural indexing

In [36]:
district_summary_df = pd.DataFrame(
          [{"Total Schools": school_count,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,
         "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": overall_passing_percentage}])

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

### 26) Write and use a function to get the percentage of students who passed math
We know the number of students that passed math 
* pass_math_count
And the total number of students for a school district
* student_count

A) Define a function that calculates the percentage of students that passed both math and reading and prints the passing percentage to the output when the function is called.

In [37]:
def passing_math_percent(pass_math_count, student_count):
    return pass_math_count / float(student_count) * 100

B) Assign the passing_math_count and the total_student_count variables 29,730 and 39,170, respectively
* When we run this cell, nothing will happen until we call the function.

In [38]:
passing_math_count = 29370
total_student_count = 39170

C) Now we can call the function in a new cell with the two values

In [39]:
passing_math_percent(passing_math_count, total_student_count)

74.9808526933878

### 27) Format the "Total Students" to have the comma for a thousands separator.
Let's apply this formatting technique to format the Total Students column with a thousands separator using the basic syntax: df["column"] = df["column"].map("{:,}".format)

Now let's replace df["column"] with district_summary_df["Total Students"], so our code looks like the following:

In [40]:
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

### 28) Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a $

In [41]:
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

### 29) We need to format the remaining columns accordingly:
* The "Average Reading Score" column will be formatted to one decimal place.
* The "Average Math Score" column will be formatted to one decimal place.
* The "% Passing Reading" column will be formatted to the nearest whole number percentage.
* The "% Passing Math" column will be formatted to the nearest whole number percentage
* The "% Overall Passing" column will be formatted to the nearest whole number percentage.

In [42]:
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

Verify changes in district_summary_df

In [43]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

### 30) How to Reorder Columns if they are not in the Right Order 

Here is the standard format for reordering columns:

* Reorder the columns in the order you want them to appear.

new_column_order = ["column2", "column4", "column1"]


* Assign a new or the same DataFrame the new column order.

df = df[new_column_order]


Here is the exact code to reorder this set of data: 
* Reorder the columns in the order you want them to appear.

new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

* Assign district summary df the new column order.

district_summary_df = district_summary_df[new_column_order]
district_summary_df